# Koşullu Eleman İşlemleri

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
m = np.random.randint(1,30, size = (10,3))

In [4]:
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])

In [5]:
df

   var1  var2  var3
0    18    23    23
1    16     2    20
2     8     6    24
3    28    23     9
4    21    14     9
5    15    26    23
6    24     4     9
7    13     9    27
8     8    24     9
9    18     4     1

In [6]:
df["var1"]

0    18
1    16
2     8
3    28
4    21
5    15
6    24
7    13
8     8
9    18
Name: var1, dtype: int32

In [7]:
df["var1"][0:2]

0    18
1    16
Name: var1, dtype: int32

In [8]:
df[0:2]["var1"]

0    18
1    16
Name: var1, dtype: int32

In [9]:
df[0:2][["var1", "var2"]]

   var1  var2
0    18    23
1    16     2

In [10]:
df

   var1  var2  var3
0    18    23    23
1    16     2    20
2     8     6    24
3    28    23     9
4    21    14     9
5    15    26    23
6    24     4     9
7    13     9    27
8     8    24     9
9    18     4     1

In [12]:
df[df.var1 > 15]["var1"]

0    18
1    16
3    28
4    21
6    24
9    18
Name: var1, dtype: int32

In [13]:
df[df.var1 > 15]["var2"]

0    23
1     2
3    23
4    14
6     4
9     4
Name: var2, dtype: int32

In [14]:
df[(df.var1 > 15) & (df.var3 < 5)]

   var1  var2  var3
9    18     4     1

In [16]:
df.loc[(df.var1 > 15), ["var1", "var2"]]

   var1  var2
0    18    23
1    16     2
3    28    23
4    21    14
6    24     4
9    18     4

In [17]:
df[(df.var1 >15)]["var1"]

0    18
1    16
3    28
4    21
6    24
9    18
Name: var1, dtype: int32

In [18]:
df[(df.var1 >15)][["var1", "var2"]]

   var1  var2
0    18    23
1    16     2
3    28    23
4    21    14
6    24     4
9    18     4